{
    "START":
        "Hola, sóc un bot que envia una imatge captcha a cada usuari nou que s'uneix al grup, i expulso (kick) als que no resolen el captcha en un temps determinat.\n\nSi un usuari ha intentat unir-se al grup 5 vegades i mai no ha resolt el captcha, suposaré que aquell \"usuari\" és un bot i el bandejaré (ban). A més, qualsevol missatge que contingui un URL i hagi estat enviat per un \"usuari\" nou abans que aquest hagi resolt el captcha, serà considerat un missatge brossa (SPAM) \ni l'esborraré.\n\nRecordeu que per a funcionar de forma adequada heu de donar-me permisos d'administració per a suspendre (expulsar) usuaris i eliminar missatges del grup.\n\nDoneu un cop d'ull a l'ordre /help per a obtenir més informació sobre el meu ús.\n\nUs sóc útil? Feu una ullada a l'ordre /about i penseu en fer una donació per mantenir-me actiu.",

    "HELP":
        "Ajuda sobre el bot:\n————————————————\n- Sóc un bot que envia un captcha a cada usuari nou que s'uneix al grup, i expulso (kick) als que no resolen el captcha en un temps determinat.\n\n- Si un usuari ha intentat unir-se al grup 5 vegades i mai no ha resolt el captcha, suposaré que aquell \"usuari\" és un bot i el bandejaré (ban).\n\n- Qualsevol missatge que contingui un URL i hagi estat enviat per un \"usuari\" nou abans que aquest hagi resolt el captcha, serà considerat un missatge brossa (SPAM) i l'esborraré.\n\n- Heu de donar-me permisos d'administració per a expulsar usuaris i eliminar missatges.\n\n- Per tal de mantenir net el grup, elimino aquells missatges que tinguin relació amb mi quan no s'hagi resolt el captcha i l'usuari hagi estat expulsat (kick) (transcorreguts 5 minuts).\n\n- El temps del que disposen els usuaris per a resoldre el captcha són 5 minuts, però es pot canviar mitjançant l'ordre /time.\n\n- Podeu activar o desactivar la protecció captcha mitjançant les ordres /enable i /disable.\n\n- Les ordres de configuració només les poden utilitzar els administradors del grup.\n\n- Podeu canviar l'idioma en el que parlo mitjançant l'ordre /language.\n\n- Podeu configurar el nivell de dificultat del captcha mitjançant l'ordre /difficulty.\n\n- Podeu establir que els captcha només continguin números (per defecte), o números i lletres, or a math equation to be solved, or a custom poll, or just a button, a través de l'ordre /captcha_mode.\n\n- Podeu configurar un missatge de benvinguda personalitzat amb ordre /welcome_msg.\n\n- You can enable an option to let me apply restriction to new joined users to send non-text messages using command /restrict_non_text.\n\n- If the Bot is Private, allow groups with command /allowgroup.\n\n- You can configure a group from private Bot chat through /connect command.\n\n- You can block users to send any message that contains an URL/link in a group by /url_disable command.\n\n- Doneu un cop d'ull a l'ordre /commands per a veure un llistat amb totes les ordres disponibles i una breu descripció de cadascuna.",

    "COMMANDS":
        "Llistat d'ordres:\n————————————————\n/start - Mostra la informació inicial sobre el bot.\n\n/help - Mostra la informació d'ajuda.\n\n/commands - Mostra el missatge actual: informació sobre totes les ordres disponibles i la seva descripció.\n\n/language - Permet canviar l'idioma en que parla el bot.\n\n/time - Permet canviar el temps disponible per a resoldre un captcha.\n\n/difficulty - Permet canviar el nivell de dificultat del captcha (d'1 a 5).\n\n/captcha_mode - Permet canviar el mode-caràcter del captcha (nums: només números, hex: números i lletres A-F, ascii: números i lletres A-Z, math: operació matemàtica, poll: enquesta personalitzada configurable, button: només un botó).\n\n/captcha_poll - Configura una enquesta personalitzada i les seves opcions quan el captcha està en mode enquesta.\n\n/welcome_msg - Permet configurar un missatge de benvinguda que s’envia després de resoldre el captcha.\n\n/welcome_msg_time - Permet configurar el temps que tarda en desaparèixer el missatge de benvinguda.\n\n/restrict_non_text - Quan un usuari nou resol el captcha, aplica una restricció d'enviament de missatges de mèdia (imatges, videos, àudios) per 1 dia (o sempre, utilitzant la paraula \"forever\" ).\n\n/add_ignore - No planteja el captcha a un usuari ignorat.\n\n/remove_ignore - Treu un usuari de la llista d'ignorats.\n\n/ignore_list - llista d'usuaris ignorats' IDs.\n\n/remove_solve_kick_msg - Configura si els missatges de captcha resolt o d'expulsió han de ser eliminats després d'un temps.\n\n/remove_welcome_msg - Configura si el missatge de benvinguda s'ha d'eliminar passat un temps.\n\n/url_disable - No permet als usuaris del grup enviar missatges que continguin enllaços web (URLs).\n\n/url_enable - Permet als usuaris del grup enviar missatges que continguin enllaços a webs (URLs).\n\n/remove_all_msg_kick_off - Configura el Bot perquè no elimini els missatges de text dels usuaris que no han resolt el captcha.\n\n/remove_all_msg_kick_on - Configura el Bot perquè elimini tots els missatges enviats per usuaris que no han resolt el captcha.\n\n/allowgroup - Permet als usuaris del grup utilitzar el Bot (si el Bot és privat).\n\n/enable - Activa la protecció per captcha al grup.\n\n/disable - Desactiva la protecció per captcha al grup.\n\n/checkcfg - Mostra la configuració de captcha del grup actual.\n\n/chatid - Mostra el Chat ID del xat axtual.\n\n/connect - Connecta el bot a un grup per configurar-lo des del xat en privat amb el Bot.\n\n/disconnect - Desconnecta el Bot d'un grup que s'està configurant des d'un xat privat amb el Bot.\n\n/version - Consulta la versió del bot.\n\n/about - Mostra la informació \"Quant a...\" del bot.",

    "CMD_NOT_ALLOW":
        "Aquesta ordre només la pot utilitar un administrador.",

    "LANG_CHANGE":
        "S'ha canviat l'idioma a català.",

    "LANG_SAME":
        "Ja parlo en català.\n\nIdiomes compatibles:\n{}",

    "LANG_BAD_LANG":
        "Idioma no vàlid.\n\nIdiomes compatibles:\n{}",

    "LANG_NOT_ARG":
        "Cal que especifiqueu un idioma.\n\nExemples:\n{}",

    "TIME_CHANGE":
        "S'ha canviat el temps per a resoldre el captcha a {}.",

    "WELCOME_TIME_CHANGE":
        "Temps per eliminar el missatge de bevinguda canviat a {}.",

    "TIME_OUT_RANGE":
        "Temps no vàlid, ha de ser en un rang de 10 segons a {} min.",

    "TIME_NOT_NUM":
        "El temps introduït no és un número enter.",

    "TIME_NOT_ARG":
        "Cal que especifiqueu un valor de temps.\n\nExemples:\n/time 30 sec\n/time 5 min\n/time 1 min",

    "WELCOME_TIME_NOT_ARG":
        "Aquesta ordre necessita un valor de temps per ser configurada.\n\nExemples:\n/welcome_msg_time 30 sec\n/welcome_msg_time 5 min\n/welcome_msg_time 1 min",

    "DIFFICULTY_CHANGE":
        "S'ha canviat el nivell de dificultat dels captcha a {}.",

    "DIFFICULTY_NOT_NUM":
        "El nivell de dificultat introduït no és un número.",

    "DIFFICULTY_NOT_ARG":
        "Cal que especifiqueu un nivell de dificultat (de l'1 al 5).\n\nExemples:\n/difficulty 1\n/difficulty 2\n/difficulty 3\n/difficulty 4\n/difficulty 5",

    "CAPTCHA_MODE_CHANGE":
        "S'ha canviat el mode-caràcter dels captcha a \"{}\".",

    "CAPTCHA_MODE_INVALID":
        "Mode-caràcter no vàlid. Els modes disponibles són: \"nums\", \"hex\", \"ascii\", \"math\", \"button\", \"poll\" i \"random\".\n\nExemples:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii\n/captcha_mode math\n/captcha_mode button\n/captcha_mode poll\n/captcha_mode random",

    "CAPTCHA_MODE_NOT_ARG":
        "Cal que especifiqueu un mode-caràcter. Els modes disponibles són:\n- Captcha numèrics (\"nums\").\n- Captcha hexadecimals, amb números i lletres A-F (\"hex\").\n- Captcha amb números i lletres A-Z (\"ascii\").\n- Operació matemàtica (\"math\").\n- Repte de prémer un botó (\"button\").\n- Enquesta personalitzada (\"poll\").\n- Repte aleatori (\"random\").\n\nExemples:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii\n/captcha_mode math\n/captcha_mode button\n/captcha_mode poll\n/captcha_mode random",

    "WELCOME_MSG_SET":
        "El missatge de benvinguda s'ha configurat correctament.",

    "WELCOME_MSG_UNSET":
        "Missatge de benvinguda desactivat.",

    "WELCOME_MSG_SET_NOT_ARG":
        "Escriviu el missatge de benvinguda després de l'ordre.\n\nExemple:\n/welcome_msg Hola $user, benvingut al grup i recorda ser respectuós amb els altres usuaris.\n\nDesactiva el missatge:\n/welcome_msg disable",

    "RESTRICT_NON_TEXT_MSG_ENABLED":
        "Restriction to send non-text messages for new users enabled. I'm gonna remove new joined users permissions except text messages send.\n\n[This text needs translate to actual configured language]",

    "RESTRICT_NON_TEXT_MSG_DISABLED":
        "Restriction to send non-text messages for new users disabled.\n\n[This text needs translate to actual configured language]",

    "RESTRICT_NON_TEXT_MSG_NOT_ARG":
        "Set if you want to enable or disable new join users restriction to send non-text messages (Don't allow user send media or others messages rather than text ones. Admins can manually give that permissions to users again in the future).\n\nExamples:\n/restrict_non_text enable\n/restrict_non_text enable forever\n/restrict_non_text enable forever\n/restrict_non_text disable\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_NOT_ARG":
        "Please, place the user's ID/alias after the command.\n\nExample:\n/add_ignore 1234567890\n/add_ignore @peter\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_DUPLICATED":
        "This ID/alias is already in ignore list.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_LIMIT_EXCEEDED":
        "Unfortunately, you have reach the maximum limit of users added in the ignore list, remove someone to add more.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_INVALID":
        "This ID/alias is invalid.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_SUCCESS":
        "The ID/alias has been added successfully!\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_REMOVE_NOT_ARG":
        "Please, place the user's ID/alias after the command.\n\nExample:\n/remove_ignore 1234567890\n/remove_ignore @peter\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_REMOVE_SUCCESS":
        "The ID/alias has been removed successfully!\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_REMOVE_NOT_IN_LIST":
        "This ID is not in ignore list, nothing was done.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_EMPTY":
        "Ignore list of the chat is empty.\n\n[This text needs translate to actual configured language]",

    "NEW_USER_IMG_CAPTION":
        "Hola {}, benvingut/da a {}. Podeu enviar un missatge amb el número que apareix en aquesta imatge per a verificar que sou un humà. Si no resoleu aquest captcha en {}, sereu expulsat del grup automàticament.",

    "NEW_USER_MATH_CAPTION":
        "Hello {}, welcome to {}. Please write a message with the result of this math equation to verify that you are a human. If you don't solve this captcha in {}, you will be automatically kicked out of the group.",

    "NEW_USER_BUTTON_MODE":
        "Hello {}, welcome to {}. Please press the button below to verify that you are a human. If you don't do this in {}, you will be automatically kicked out of the group.\n\n[This text needs translate to actual configured language]",

    "CAPTCHA_SOLVED":
        "Heu resolt el captcha correctament. Ja sou un usuari verificat.\nBenvingut/da al grup, {}",

    "CAPTCHA_INCORRECT_0":
        "Aquest codi no és correcte. Intenteu-ho una altra vegada...",

    "CAPTCHA_INCORRECT_1":
        "Aquest codi no és correcte. Fixeu-vos-hi bé, el captcha té 4 caràcters...",

    "CAPTCHA_INCORRECT_MATH":
        "Aquest resultat no és correcte. Comproveu-ho, heu de resoldre la operació matemàtica...",

    "NEW_USER_KICK":
        "{} no ha aconseguit resoldre el captcha. L'\"usuari\" ha estat expulsat.",

    "NEW_USER_KICK_NOT_RIGHTS":
        "L'\"usuari\" {} hauria de ser expulsat, però no se m'han donat els permisos d'administració necessaris per a expulsar usuaris del grup.",

    "NEW_USER_KICK_NOT_IN_CHAT":
        "Estava a punt d'expulsar l'\"usuari\" {}, però ja no és al grup (ha sortit del grup o ha estat expulsat/bandejat per un administrador).",

    "BOT_CANT_KICK":
        "He intentat expulsar l'\"usuari\" {}, però a causa d'un problema inesperat (potser relacionat amb la xarxa o el servidor), no ho he pogut fer.",

    "CANT_DEL_MSG":
        "He intentat esborrar aquest missatge, però no se m'han donat els permisos d'administració necessaris per tal d'eliminar els missatges que no són meus.",

    "NEW_USER_BAN":
        "Atenció: L'usuari {} s'ha equivocat en la resposta {} vegades. \"User\" ha estat bandejat. Per permetre-li entrar una altra vegada, un administrador ha de retirar l'usuari \"user\" de la llista de bandejats a les opcions del grup.",

    "NEW_USER_BAN_NOT_IN_CHAT":
        "Atenció: L'usuari {} s'ha equivocat en la resposta {} vegades. He intentat bandejar l'usuari \"User\", però ja no és al grup (ha marxat del grup o algun administrador l'ha expulsat).",

    "NEW_USER_BAN_NOT_RIGHTS":
        "Warning: User {} fail to solve the captcha {} times. I tried to ban the \"User\", but I don't have administration rights to ban users in the group.",

    "BOT_CANT_BAN":
        "Warning: User {} fail to solve the captcha {} times. I tried to ban the \"User\", but due to an unexpected problem (maybe network/server related), I can't do it.",

    "SPAM_DETECTED_RM":
        "S'ha detectat un missatge que conté un URL (o àlies) enviat per {}, que encara no ha resolt el captcha. He eliminat el missatge per tal de tenir el grup net de brossa:)",

    "SPAM_DETECTED_NOT_RM":
        "S'ha detectat un missatge amb URL (o àlies) enviat per {}, que encara no ha resolt el captcha. He intentat esborrar el missatge, però no se m'han donat els permisos d'administració necessaris per tal d'eliminar missatges que no són meus.",

    "NOT_TEXT_MSG_ALLOWED":
        "He eliminat un missatge que no és de text (imatge, àudio, fitxer...) enviat per {}, per tal de mantenir el grup net de brossa.\n\nPodreu enviar missatges que no siguin de text un cop hàgiu resolt el captcha.",

    "RM_SOLVE_KICK_MSG":
        "Configura si els missatges de resposta al captcha i d'expulsió s'han eliminar al cap d'una estona.\n\nExemples:\n/remove_solve_kick_msg yes\n/remove_solve_kick_msg no",

    "RM_SOLVE_KICK_MSG_YES":
        "Configuració canviada, els missatges de resposta al captcha i d'expulsió seran eliminats al cap d'una estona.",

    "RM_SOLVE_KICK_MSG_NO":
        "Configuració canviada, els missatges de resposta al captcha i d'expulsió no seran eliminats.",

    "RM_WELCOME_MSG":
        "Configura si els missatges de benvinguda han de ser eliminats al cap d'una estona.\n\nExemples:\n/remove_welcome_msg yes\n/remove_welcome_msg no",

    "RM_WELCOME_MSG_YES":
        "Configuració canviada, els missatges de benvinguda seran eliminats al cap d'una estona.",

    "RM_WELCOME_MSG_NO":
        "Configuració canviada, els missatges de benviguda no seran eliminats.",

    "OTHER_CAPTCHA_BTN_TEXT":
        "Mostra un altre captcha",

    "PASS_BTN_TEXT":
        "No sóc un Bot",

    "URL_MSG_NOT_ALLOWED_DETECTED":
        "Detectat i eliminat un missatge que conté una URL/enllaç enviat per {}.\n\nAquest grup no permet URLs als missatges (només els administradors poden configurar el Bot per metre URLs als missatges).",

    "URL_ENABLE":
        "D'acord, ara els usuaris poden enviar URLs i enllaços a aquest grup. Podeu prohibir-ho una altra vegada amb l'ordre /url_disable ",

    "URL_DISABLE":
        "D'acord, ara els usuaris no poden enviar URLs i enllaços a aquest grup. Ho podeu permetre una altra vegada amb l'ordre /url_enable ",

    "CONFIG_ALREADY_SET":
        "Aquesta configuració ja està activada.",

    "CONFIG_ALREADY_UNSET":
        "Aquesta configuració ja està desactivada.",

    "ENABLE":
        "S'ha activat la protecció per captcha. Podeu desactivar-la amb l'ordre /disable.",

    "DISABLE":
        "S'ha desactivat la protecció per captcha. Podeu activar-la amb l'ordre /enable.",

    "ALREADY_ENABLE":
        "La protecció per captcha ja està activada.",

    "ALREADY_DISABLE":
        "La protecció per captcha ja està desactivada.",

    "CAN_NOT_GET_ADMINS":
        "No es pot utilitzar aquesta ordre al xat actual.",

    "VERSION":
        "La versió actual del bot és:\n{}",

    "ABOUT_MSG":
        "Aquest és un bot de programari lliure i codi obert (open-source) amb llicència GNU-GPL, desenvolupat per {}\n\nPodeu consultar el codi font aquí:\n{}\n\nUs agrada el que faig? Convideu-me a un cafè:\n{}",

    "POLL_NEW_USER":
        "Hola {}, benvingut/da a {}. Si us plau, resolt l'enquesta per demostrar que no ets un Bot. Si no ho fas en {}, automàticament seràs expulsat del grup.",

    "CAPTCHA_POLL_FAIL":
        "La resolució del captcha ha fallat, {} ha seleccionat una resposta incorrecte. Seràs expulsat en 10s. Pots tornar a intentar entrar al grup...",

    "CAPTCHA_POLL_USAGE":
        "Configura la pregunta i opcions de l'enquesta Captcha\n————————————————\nEl text de la pregunta no pot excedir els {} caràcters.\n\nLes opcions no poden excedir els {} caràcters.\n\nEl nombre màxim d'opcions són {}.\n————————————————\nFixa la pregunta de l'enquesta:\n/captcha_poll question Segur que vols entrar a aquest grup?\n\nSet Poll Option 1:\n/captcha_poll opció 1 No, no vull entrar-hi.\n\nSet Poll Option 2:\n/captcha_poll opció 2 Sí, sóc humà i vull entrar al grup.\n\nSet Poll Option 3:\n/captcha_poll opció 3 Qui soc i què estic fent??\n\nRemove Poll Option 2:\n/captcha_poll opció 2 eliminada\n\nFixa la resposta correcte a la 2a opció:\n/captcha_poll correct_option 2\n\nCanvia el Captcha a tipus enquesta:\n/captcha_mode poll",

    "POLL_QUESTION_CONFIGURED":
        "La pregunta de l'enquesta captcha ha estat configurada correctament.",

    "POLL_OPTION_CONFIGURED":
        "La resposta {} de l'enquesta captcha ha estat configurada correctament.",

    "POLL_CORRECT_OPTION_CONFIGURED":
        "La resposta correcte de l'enquesta captcha ha estat configurada a l'opció {}.",

    "POLL_CORRECT_OPTION_NOT_CONFIGURED":
        "Poll option number {} doesn't exists, please configure the option first.\n\nExample:\n/captcha_poll question Is 1+2 equal to 5?\n\n/captcha_poll option 1 Yes\n\n/captcha_poll option 2 No\n\n/captcha_poll correct_option 2\n\n/captcha_mode poll",

    "POLL_NEW_USER_NOT_CONFIG":
        "A new user has come, but Captcha Poll is not totally configured.\n\nPoll question, Poll correct answer and minimum 2 answer options needs to be configured. Please, configure it with /captcha_poll command.\n\nExample:\n/captcha_poll question Is 1+2 equal to 5?\n\n/captcha_poll option 1 Yes\n\n/captcha_poll option 2 No\n\n/captcha_poll correct_option 2\n\n/captcha_mode poll",

    "CONNECT_USAGE":
        "Heu d'especificar el chat ID del grup que voleu configurar (utilitza la ordre /chatid dins del grup per saber-lo).\n\nExemple:\n/connect -1234567890",

    "CONNECT_JUST_ADMIN":
        "Només els administradors d'aquest grup poden configurar-lo.",

    "CONNECT_OK":
        "Connectat al grup {}. Ja pots configurar les opcions de captcha des del xat privat.",

    "DISCONNECT_NOT_CONNECTED":
        "No estic connectat.",

    "DISCONNECT_OK":
        "Desconnectat del grup {}.",

    "INVALID_GROUP_ID":
        "Chat ID no vàlid.",

    "CHECK_CFG":
        "Configuració del grup:\n————————————————\n```\n{}\n```",

    "CMD_NOT_ALLOW_PRIVATE":
        "Aquesta ordre no es pot utilitzar al xat privat.",

    "CMD_NEEDS_CONNECTION":
        "Aquesta ordre no es pot utilitzar al xat privat fins que no us connecteu a un grup per configurar-lo (/connect).",

    "CMD_JUST_IN_PRIVATE":
        "Aquesta ordre no es pot utilitzar a un grup (s'ha d'utilitzat al xat privat amb el Bot).",

    "RM_ALL_MSGS_AFTER_KICK_ON":
        "La configuració ha canviat, tots els missatges enviats per usuaris que no han resolt el captcha seran eliminats.",

    "RM_ALL_MSGS_AFTER_KICK_OFF":
        "La configuració ha canviat, tots els missatges enviats per usuaris que no han resolt el captcha NO seran eliminats"
}
